/**
 * 시험 
 * 
 * 1. 컴파일
 * 
 * 2. printf
 * 
 * 3. 변수 선언과 초기화
 *    - int num = 4; 선언
 *    - int num; 초기화
 *    - "=" 대입연산자 : 대입
 *     # const : 상수(대입하면 초기화 X)
 *     - const num = 4; 선언과 동시에 초기화
 *     # 자료형 
 *     - int, double, char 등등
 *     - 정수형, 실수형 
 *        - 정수형 : short, int, long, longlong %d
 *        - 실수형 : float, double, ... %lf
 *        - 문자형 : char (' ') %c
 *        - 문자열형 : string (" ") %s
 *        - int 숫자제한 및 음수 양수
 *        - unsigned int : 양수만 사용 선언 , 양이 2배
 * 4. scanf ( %d -> &ooo)
 * 
 * 5. naming rule(제일 중요) : 규칙 암기!!!!
 *  ex) 숫자로 시작불가, 대문자 사용가능, 예약어 사용불가 등
 *      - 합성어 표기법 : 파스칼, 카멜, 스네이크 차이점 
 * 
 * 6. 연산자( + - * / %)
 *    / 몫
 *    % 나머지
 * 
 * 7. 논리 연산자(매우 중요!!!)
 * 
 *   &&(and) ||(or) 
 *    - 한개 썼을때와 2개 썼을때 차이점
 *    - > , < >=, <=, ==(같다)
 * 
 *   sizeof : byte 단위 
 *     -영문자 1글자 한글 2글자 1byte
 * 
 *  int -> double : (doble)a : 이렇게 변경
 *  doble > int : 값의 손실 주의주의주의!!!
 * 
 *  삼항연산자
 *  - (조건) ? 값1 : 값2
 * 
 * 
 * 8. if문
 *    -if(조건) {
 *       실행문
 *      } 
 * 
 *    - 조합법
 * 
 *   - 수합(값변환)
*/